using System;


namespace blagodarq
{
    class blagodarq
    {
        static void Main(string[] args)
        {
            for (int i = 3; i >= 0; i--)
            {
                Console.Write("Моля напишете вашето име на кирилица: ");
                string name = Console.ReadLine().ToLower();

                switch (name)
                {
                    case "роси":
                    case "роси ненова":
                    case "кристиян":
                    case "кристиян памидов":
                    case "валентин":
                    case "валентин димитров":
                        Console.WriteLine(@"    Скъпи ментори, здравейте! Записах следващия курс(Ти да видиш ???)
и искам да Ви изкажа моите най - сърдечни благодарности за помощта, която ми оказахте
и времето, което ми отделихте ! Много бих искал да ме удостоите с честта да Ви заведа
на сладкарница или някъде другаде 😉 С две думи - да се облажим в удобно за Вас време и място !
    
                                                                                Пламен");
                        return;
                        
                    default:
                        if (i > 0)
                        {
                            Console.WriteLine($"Грешен потребител! Остават ви {i} опита.");
                        }
                        break;
                }
            }

            Console.WriteLine("Колкото и да се опитваш, за теб торта НЯМА!!!");
            
        }
    }
}
